Autodesk.Navisworks.Api.Data.NavisworksTransaction
Implementation of DbTransaction.

Autodesk.Navisworks.Api.Data.NavisworksTransaction.Commit
Commits the current transaction.

Autodesk.Navisworks.Api.Data.NavisworksTransaction.Connection
Returns the underlying connection to which this transaction applies.

Autodesk.Navisworks.Api.Data.NavisworksTransaction.DbConnection
Forwards to the local Connection property

Autodesk.Navisworks.Api.Data.NavisworksTransaction.Dispose(System.Boolean)


Autodesk.Navisworks.Api.Data.NavisworksTransaction.IsolationLevel
Gets the isolation level of the transaction.  NavisworksTransaction only supports Serializable transactions.

Autodesk.Navisworks.Api.Data.NavisworksTransaction.Rollback
Rolls back the active transaction.